#### Instalação das Bibliotecas necessárias.

In [10]:
import pandas as pd
import sqlalchemy

In [4]:
!pip install pymysql

Requirement already satisfied: pymysql in /home/felipe/anaconda3/lib/python3.6/site-packages (0.9.3)
distributed 1.21.8 requires msgpack, which is not installed.
You are using pip version 10.0.1, however version 18.1 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

#### Engine de Conexão ao Banco de Dados MySQL.

Sintaxe:<br>
engine = sqlalchemy.create_engine(
'mysql+**drive**://**usuario**:**senha**@**ip-servidor**:**porta**/**banco-de-dados**')

#### Documentação do SQLAlchemy.

https://docs.sqlalchemy.org/en/latest/core/engines.html

#### Criando a Conexão.

In [12]:
engine = sqlalchemy.create_engine('mysql+pymysql://felipe:M1nerandodados.@localhost:3306/employees')

## Método:  read_sql_table

#### Paramentros do método read_sql_table

* **table_name** = Nome da tabela onde será feita a leitura dos dados.
* **con** = Objeto conexão criado pelo SQLAlchemy.
* **schema**= Schema onde a tabela está armazenada.
* **index_col** = Coluna a ser definida como index.
<br>...

#### Lendo toda a tabela Employees e transformando em DataFrame.

In [13]:
df = pd.read_sql_table('employees',engine)

#### Listando os dados e informações dos atributos.

In [15]:
df.head()

   emp_no birth_date first_name last_name gender  hire_date
0   10001 1953-09-02     Georgi   Facello      M 1986-06-26
1   10002 1964-06-02    Bezalel    Simmel      F 1985-11-21
2   10003 1959-12-03      Parto   Bamford      M 1986-08-28
3   10004 1954-05-01  Chirstian   Koblick      M 1986-12-01
4   10005 1955-01-21    Kyoichi  Maliniak      M 1989-09-12

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
emp_no        300024 non-null int64
birth_date    300024 non-null datetime64[ns]
first_name    300024 non-null object
last_name     300024 non-null object
gender        300024 non-null object
hire_date     300024 non-null datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(3)
memory usage: 13.7+ MB

**Lendo apenas algumas colunas da tabela.**

In [17]:
df = pd.read_sql_table('employees', engine, columns=["first_name","last_name"])

In [18]:
df.head()

  first_name last_name
0     Georgi   Facello
1    Bezalel    Simmel
2      Parto   Bamford
3  Chirstian   Koblick
4    Kyoichi  Maliniak

## Método:  read_sql_query

#### Paramentros do método read_sql_query

* **sql** = String SQL Query que deverá ser executada para retornar o conjunto de dados.
* **con** = Objeto conexão criado pelo SQLAlchemy.
* **index_col** = Coluna a ser definida como index.
* **params**= Lista de parametros para serem passados ao método.
<br>...

#### Criando um DataFrame apartir de uma query ao banco de dados.

In [20]:
df = pd.read_sql_query("select * from employees",engine)

In [22]:
df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

#### Criando um DataFrame apartir de uma query ao banco de dados utilizando a coluna emp_no com index.

In [23]:
df_index = pd.read_sql_query("select * from employees",engine,index_col="emp_no")

In [24]:
df_index.head()

        birth_date first_name last_name gender   hire_date
emp_no
10001   1953-09-02     Georgi   Facello      M  1986-06-26
10002   1964-06-02    Bezalel    Simmel      F  1985-11-21
10003   1959-12-03      Parto   Bamford      M  1986-08-28
10004   1954-05-01  Chirstian   Koblick      M  1986-12-01
10005   1955-01-21    Kyoichi  Maliniak      M  1989-09-12

#### Criando um DataFrame apartir de uma query ligando várias tabelas.

In [25]:
query = '''
SELECT  emp.first_name,
        emp.last_name,
        emp.gender,
        depar.dept_name as departament_name,
        dept.from_date,
        dept.to_date
FROM employees emp
INNER JOIN dept_emp dept
ON emp.emp_no = dept.emp_no
INNER JOIN departments depar
ON dept.dept_no = depar.dept_no;
'''

In [26]:
df = pd.read_sql_query(query,engine)

In [28]:
df.head()

  first_name    last_name gender  departament_name   from_date     to_date
0       Mary        Sluis      F  Customer Service  1990-01-22  1996-11-09
1       Huan        Lortz      M  Customer Service  1989-09-20  9999-01-01
2      Basil       Tramer      F  Customer Service  1992-05-04  9999-01-01
3   Breannda  Billingsley      M  Customer Service  1992-11-11  9999-01-01
4   Jungsoon     Syrzycki      F  Customer Service  1992-03-21  9999-01-01

#### Criando um DataFrame apartir de uma query utilizando parametros dinâmicos.

In [29]:
query = 'SELECT first_name, last_name ' \
      'FROM employees ' \
      'WHERE first_name = %s'

In [30]:
df = pd.read_sql_query(query, engine,params=["Mary"])

In [31]:
df.head()

  first_name last_name
0       Mary     Sluis
1       Mary   Wossner
2       Mary    Piazza
3       Mary      Ertl
4       Mary    Cooley

#### Criando um DataFrame apartir de uma query utilizando parametros nomeados.

In [32]:
query = '''
SELECT  emp.first_name,
        emp.last_name,
        emp.gender,
        depar.dept_name as departament_name,
        dept.from_date,
        dept.to_date
FROM employees emp
INNER JOIN dept_emp dept
ON emp.emp_no = dept.emp_no
INNER JOIN departments depar
ON dept.dept_no = depar.dept_no
WHERE dept.from_date >= %(data_inicial)s AND to_date < %(data_final)s
'''

In [33]:
df = pd.read_sql_query(query, 
                       engine,
                       params={'data_inicial':"1990-01-22",
                                'data_final':"1996-11-09"}
                      )

In [34]:
df.head()

  first_name last_name gender  departament_name   from_date     to_date
0      Genta    Kolvik      M  Customer Service  1993-03-31  1994-10-23
1    Willard     Rosin      F  Customer Service  1995-04-25  1996-03-29
2       Maik   Ushiama      M  Customer Service  1992-06-09  1993-02-10
3      Danco    Etalle      M  Customer Service  1993-07-03  1993-09-19
4      Marco  DasSarma      M  Customer Service  1990-02-27  1996-03-20

## Método:  read_sql

#### Faz o roteamento entre os métodos read_table e read_sql_query.

#### Paramentros do método read_sql.

* **sql** = String SQL Query que deverá ser executada para retornar o conjunto de dados.
* **con** = Objeto conexão criado pelo SQLAlchemy.
* **index_col** = Coluna a ser definida como index.
* **params**= Lista de parametros para serem passados ao método.
<br>...

#### Criando o DataFrame passando apenas o nome da tabela para o método.

In [35]:
df = pd.read_sql("departments",engine)

In [36]:
df.head()

  dept_no         dept_name
0    d009  Customer Service
1    d005       Development
2    d002           Finance
3    d003   Human Resources
4    d001         Marketing

#### Criando o DataFrame através de uma query.

In [38]:
df = pd.read_sql("SELECT * FROM departments",engine)

In [39]:
df.head()

  dept_no         dept_name
0    d009  Customer Service
1    d005       Development
2    d002           Finance
3    d003   Human Resources
4    d001         Marketing

## Método:  to_sql

#### Escreve o DataFrame para o Banco de Dados Relacional.

#### Carregando a base de dados e criando o DataFrame.

In [44]:
df = pd.read_csv("automobile.csv")

In [45]:
df.head()

   symboling normalized-losses         make fuel-type aspiration
0          3                 ?  alfa-romero       gas        std
1          3                 ?  alfa-romero       gas        std
2          1                 ?  alfa-romero       gas        std
3          2               164         audi       gas        std
4          2               164         audi       gas        std

#### Paramentros do método to_sql.

* **name** = Nome da tabela que será criada no SGBD.
* **con** = Objeto conexão criado pelo SQLAlchemy.
* **schema** = Nome do Schema onde será criada a tabela.
* **if_exists**= Comportamento caso a tabela exista no SGBD.
* **index**= Escreve o índice do DataFrame como uma coluna da tabela.
* **index_label**= Nome da coluna de índice.

**Criando a tabela no Banco de Dados a partir do DataFrame.**

In [46]:
df.to_sql(
    name = 'tb_automobile',
    con = engine,
)

**Criando a tabela no Banco de Dados sem a coluna de índice.**

In [51]:
df.to_sql(
    name = 'tb_automobile',
    con = engine,
    index = False,
    if_exists ='append'
)